{"body": "A gunman is holding staff and customers hostage at a cafe in Sydney, Australia.\n\nThe Lindt cafe in the city centre is surrounded by armed police. Officers have made contact with the gunman.\n\nFive people have been seen running from the building. It is not clear how many remain inside. A black Islamic flag has been displayed at the window.\n\nPrime Minister Tony Abbott said it was \"profoundly shocking\" that people were being \"held hostage by an armed person claiming political motivation\".\n\nHe was speaking after chairing a meeting of the national security committee in Canberra.\n\nEarlier Mr Abbott said: \"Australia is a peaceful, open and generous society - nothing should ever change that and that's why I would urge all Australians today to go about their business as usual.\"\n\nSenior police officers say they are on a footing \"consistent with a terrorist event\".\n\nThe incident began as people were arriving for work in Martin Place on Monday. Witnesses saw a man with a bag and gun walk into the Lindt chocolate shop and cafe.\n\nLindt said about 10 employees and 30 customers were thought to be inside at the time. Nearby offices were evacuated and police asked people to remain indoors and away from open windows.\n\nThe BBC's Jon Donnison in Sydney says an enormous police operation is in place, on a scale few Sydney residents will have seen.\n\nAbout six hours into the siege, three people were seen running from the building housing the cafe. Two more people followed about an hour later. It is not clear whether they escaped or were released.\n\nNew South Wales Police deputy commissioner Catherine Burn said: \"Those people are now being assessed to make sure their health is okay and then police will talk to them.\"\n\n\"Our approach is to resolve this peacefully. It might take a bit of time but that is our priority,\" she added.\n\nPolice have identified the gunman and he is well known to them, Australian media report.\n\nNews organisations also say the suspect has contacted them to issue demands, which police have urged media not to report.\n\nChannel 7, a broadcaster with offices facing the cafe, said lights inside the premises were turned out as night fell.\n\nThe atmosphere in Martin Place itself was surreal. Office workers who had been evacuated from their buildings, construction workers from building sites and tourists packed the pedestrian plaza one block away from the Lindt coffee shop.\n\nRosemary D'Urso Healion had just come out of the Martin Place subway station and was walking to her office when she saw that it was blocked by police. Then she saw the police close down the subway station.\n\n\"I work in that building [where the siege is taking place] and I was just about to go in,\" she told the BBC, adding that she had been in contact with some of her colleagues who were in the building but not being held hostage.\n\nShe remained at Martin Place anxiously watching a police operation that appeared to be aimed at getting some of her colleagues out via a ladder erected on a window ledge on the first floor.\n\nAn armed man wearing a backpack and a bandana could be seeing walking around inside the cafe.\n\nTV footage showed at least three people, thought to be employees and who were visibly distressed, holding up to the window a black flag bearing the declaration of Islamic faith, which reads: \"There is no God but Allah, and Muhammad is his messenger.\"\n\nThe flag is similar to those used by jihadist groups, but is different from the one used by Islamic State militants in the Middle East.\n\nMartin Place is home to the state premier's office and the headquarters of major banks.\n\nIn September Australia - which has sent fighter jets to join the US-led coalition conducting air strikes against Islamic State in Iraq - carried out a big anti-terror raid.\n\nOne man was charged with plotting to behead a member of the public in Martin Place.\n\nIn October, new anti-terrorism laws, including a provision designed to stop Australians fighting in overseas conflicts, were approved by the Australian parliament.\n\nAre you in Sydney? Have you witnessed the hostage situation? You can get in touch by emailing haveyoursay@bbc.co.uk.\n\nIf you are willing to talk to a BBC journalist, please leave your number.\n\nHave your say\n\nSend your pictures and videos to yourpics@bbc.co.uk or text them to 61124 (UK) or +44 7624 800 100 (international). Or you can upload here.", "description": "Hundreds of armed police seal off an area of central Sydney where a gunman is holding staff and customers hostage in a cafe.", "videos": [], "title": "Sydney siege: Hostages held in Lindt cafe", "url": "http://www.bbc.co.uk/news/world-australia-30473983", "image": "http://news.bbcimg.co.uk/media/images/79727000/jpg/_79727167_79727076.jpg", "published": "Mon, 15 Dec 2014 12:52:40 GMT", "meta": {"application-name": "BBC", "dcterms.modified": "2014-12-15T12:03:17+00:00", "twitter": {"card": "summary"}, "contentflavor": "STORY", "cps_asset_type": "STY", "msapplication-task": "name=BBC Weather;action-uri=http://www.bbc.co.uk/weather/?ocid=global-weather-pinned-ie9;icon-uri=http://news.bbcimg.co.uk/shared/img/bbccom/favicon_16.ico", "rnews": {"headline": "Gunman holds Sydney cafe hostages", "thumbnailurl": "http://news.bbcimg.co.uk/media/images/79727000/jpg/_79727165_79727076.jpg", "datepublished": "2014/12/15 12:03:17", "description": "Hundreds of armed police seal off an area of central Sydney where a gunman is holding staff and customers hostage in a cafe.", "creator": "http://www.bbc.co.uk#org"}, "headline": "Gunman holds Sydney cafe hostages", "section": "Australia", "msapplication-tilecolor": "#CC0101", "msapplication-window": "width=1024;height=768", "originalpublicationdate": "2014/12/15 12:03:17", "bbcsearch_noindex": "atom", "description": "Hundreds of armed police seal off an area of central Sydney where a gunman is holding staff and customers hostage in a cafe.", "cps_id": 30473983, "ifs_url": "/news/world-australia-30473983", "cps_platform": "HighWeb", "msapplication-tooltip": "Explore the BBC, for latest news, sport and weather, TV & radio schedules and highlights, with nature, food, comedy, children's programmes and much more", "msapplication-tileimage": "/img/1_0_3/cream/hi/news/bbc-news-pin.png", "msapplication-starturl": "http://www.bbc.com/news/?ocid=global-news-pinned-ie9", "viewport": "width = 996", "dcterms.created": "2014-12-14T23:24:12+00:00", "cps_site_name": "BBC News", "og": {"url": "http://www.bbc.co.uk/news/world-australia-30473983", "type": "article", "image": "http://news.bbcimg.co.uk/media/images/79727000/jpg/_79727167_79727076.jpg", "site_name": "BBC News", "title": "Gunman holds Sydney cafe hostages"}, "thumbnail_url": "http://news.bbcimg.co.uk/media/images/79727000/jpg/_79727165_79727076.jpg", "cps_section_path": "World/Australia", "ukfs_url": "/news/world-australia-30473983", "cps_audience": "Domestic"}, "authors": [], "images": [{"src": "http://news.bbcimg.co.uk/media/images/79729000/jpg/_79729316_79729077.jpg", "width": 144, "height": 81}, {"src": "http://news.bbcimg.co.uk/media/images/79737000/jpg/_79737359_79736727.jpg", "width": 144, "height": 81}, {"src": "http://news.bbcimg.co.uk/media/images/79731000/jpg/_79731105_79729212.jpg", "width": 624, "height": 351}, {"src": "http://news.bbcimg.co.uk/media/images/79731000/jpg/_79731032_79729919.jpg", "width": 144, "height": 81}, {"src": "http://news.bbcimg.co.uk/media/images/79730000/jpg/_79730565_79730564.jpg", "width": 624, "height": 351}, {"src": "http://news.bbcimg.co.uk/img/1_0_3/cream/hi/news/news-blocks.gif", "width": 255, "height": 40}, {"src": "http://news.bbcimg.co.uk/media/images/79729000/jpg/_79729207_025124051-1.jpg", "width": 624, "height": 351}, {"src": "http://news.bbcimg.co.uk/media/images/79727000/jpg/_79727167_79727076.jpg", "width": 464, "height": 261}, {"src": "http://news.bbcimg.co.uk/media/images/79731000/jpg/_79731024_79729919.jpg", "width": 640, "height": 360}, {"src": "http://news.bbcimg.co.uk/media/images/79736000/jpg/_79736111_79736110.jpg", "width": 640, "height": 360}, {"src": "http://news.bbcimg.co.uk/media/images/79727000/jpg/_79727562_936763fb-44ff-4f1b-8a30-9b3c0c50e6f2.jpg", "width": 624, "height": 351}, {"src": "http://news.bbcimg.co.uk/media/images/79728000/jpg/_79728383_hi025123926.jpg", "width": 640, "height": 360}, {"src": "http://news.bbcimg.co.uk/media/images/79731000/jpg/_79731217_sydney_cafe_hostages2_624map(2).jpg", "width": 624, "height": 600}]}